import React from 'react';
import HeadingAndparagraph from './HeadingAndparagraph';
import { FaRegEdit } from "react-icons/fa";


const aboutWebsite = {
    title: "About Website",
    description: "अखिल बुरुड समाज वधूवर सूचक समिती हि २०१७ पासून social media च्या माध्यमातून कार्य समाजामध्ये काम करत असते. मुख्यतः whatapp च्या माध्यमातून तर हा प्रवास चालूच आहे. जेणेकरून सर्व समाजबांधवाना सोपे व्हावे. नवीन तंत्रज्ञानाचा फायदा घेत “धरूया तंत्रज्ञानाची कस करूया समाजाच्या विकास” ह्या ब्रीदवाक्यानुसार आपली संस्था काम करत आहे. आता सध्या संस्थेच्या समितीमध्ये ११ पदाधिकारी महाराष्ट्र आणि कर्नाटका ह्या राज्यांमध्ये कार्यरत आहे. आजतागायत ह्या संस्थेच्या माध्यमातून दरवर्षी १००-१५० पेक्षा जास्त लग्न जोडले जातात. तसेच उमेदवाराच्या माहितीची योग्य शहनिशा करून मगच ती माहिती इतरांपर्यंत पोहचवत असतो. समितीने सर्व माहिती संकलित केली असून तो एकाच व्यासपीठावर उपलब्ध करून देण्याच काम ह्या संस्थेमार्फत केले आहे. whatsapp ग्रुप, facebook, youtube channel च्या माध्यमातून सुरु झालेला हा प्रवास matrimony website आणि app पर्यंत येऊन पोहचला आहे. समाजातील लोकांना घर बसल्या योग्य सुविधा देऊन समाजातील कुटुंबसंस्था विकसित कशी होईल ह्याकडे संस्थेचा मानस असतो. दिवसांपूर्वी कोरोनाच्या काळामध्ये ONLINE वधू-वर सूचक मेळावा घेतला होता. त्याला भरगोस प्रतिसाद मिळाला होता आणि तो कार्यक्रम यशस्वी झाला आहे. सदर संस्थेला समाजातून सकारात्मक नजरेने पहिले जाते. समाजासाठी होणार्या कुठल्याही महत्वाच्या कार्याला संस्थेकडून प्रोत्साहन दिले जाते. समाजाचा मानस आणि आजची ओळख लक्षात घेऊन पिंपरी चिंचवड बुरुड समाज समिती जो मेळावा आयोजित केला आहे त्यासाठीदेखील अखिल महाराष्ट्र बुरुड समाज वधूवर सूचक समितीने सहकार्याची भूमिका बजावली आहे."
};

const presidentSpeech = {
    title: "President Speech",
    description: "अखिल बुरुड समाज सेवाभावी संस्था ही बुरुड समाजासाठी विनामूल्य काम करणारी महाराष्ट्रामधील एक अग्रगण्य नोंदणीकृत संस्था म्हणून ओळखली जाते. ह्या संस्थेअंतर्गत बुरुड समाज वधूवर सूचक समिती काम करत असून महाराष्ट्र, कर्नाटक व मध्य प्रदेश अश्या विविध राज्यांमध्ये ११ whatspp गृपच्या माध्यमातून हा प्रवास सुरु आहे. आता हा प्रवास आज ॲप आणि वेबसाईट च्या माध्यमातून सर्व बुरुड समाजातर्फे उपलब्ध करून देत असताना विशेष आनंद होत आहे. “धरूया तंत्रज्ञानाची कास करूया समाजाचा विकास” हे सूत्र ठेऊन काम करत असताना समाजासाठी काहीतरी नाविन्यपूर्ण करण्याचा आमचा मानस असतो. त्यानून समाजामध्ये एक विशेष ओळख संस्थेने निर्माण केली. विशेषतः कोरोन काळात घेतले गेलेला ऑनलाइन वधूवर सूचक मेळावा असेल, पिंपरी चिंचवड येथील वधूवर परिचय मेळावा असेल अथवा समाजोपयोगी काहीही कार्यक्रम असतील तर समाजाने केवळ सकारात्मक प्रतिसाद न देता आमचे केलेले कौतुक आणि आम्हाला प्रोत्साहन दिले ह्यामुळे समाजाचे जेवढे ऋण व्यक्त करावे तितके कमी आहे. मात्र समितीमार्फत काम करत असताना बऱ्याचश्या समस्यांना तोंड देत द्यावे लागत आहे. त्यामधे समितीच्या नावाने फसव्या लोकांकडून गोरगरीब समाजाची आर्थिक आणि मानसिक फसवणूक वा योग्य database सांभाळण्यात येणाऱ्या अडचणी असो. त्याला पर्याय म्हणून ह्या ॲपची आणि वेबसाईटची निर्मिती केली आहे. तसेच महत्वाचे म्हणजे आजच्या २१ व्या शतकांत समाजाची प्रगती साधायची असल्यास आपण अश्या माध्यमांचा वापर करून आधुनिकतेशी नक्कीच समरस होऊ, तसेच ह्या ॲपमुळे आणि वेबसाईटमुळे समाज एकमेकांच्या जवळ येण्यास मदत होईल. असे मला वाटते. काळाची गरज समाजाची प्रगती साधायची असल्यास आपल्याला समाजाच्या तळागाळातील सर्व घटकांचा विचार व्हायला हवा म्हणून हे ॲप आणि वेबसाईट अतिशय साधी व समजेल अशी बनविली आहे. समाजाने जास्तीत जास्त चांगल्या पद्धतीने ह्या प्रकल्पाचा उपयोग करून घ्यावा आणि आम्हाला भरभरून प्रतिसाद द्यावा असे विनंती वजा आवाहन मी समितीचा अध्यक्ष म्हणून सर्वांना करतो. अनेक शुभेच्छा आणि धन्यवाद"
};

const sachivSpeech = {
    title: "Sachiv Speech",
    description: "धरूया तंत्रज्ञानाची कास, करूया समाजाचा विकास” हे सूत्र हाती धरून अखिल बुरुड समाज सेवाभावी संस्था संचालित अखिल महाराष्ट्र बुरुड समाज वधू वर सुचक समिती ही वर्ष २०१७पासून समाजामध्ये अतिशय जोमाने कार्यरत आहे. आपल्या समाजातील काही कुटुंब हे अजूनही तुटपुंज्या रोजगारावर काम करणारा आढळून येतो. त्यांना आधुनिक जगाच्या कक्षेत आणणे हे एक आव्हान आहे. मात्र दुसऱ्या बाजूचा विचार करता आज आपल्या समाजामध्ये बरेचसे तरुण हे विज्ञान, फार्मसी, इंजिनियरिंग, मेडिकल, एमबीए, वाणिज्य, कलासारखे व्यावसायिक क्षेत्र निवडताना दिसतात. आपल्या समाजामध्ये होणारी ही शैक्षणिक क्रांती निश्चितपणे प्रशंसनीय आहे. त्यातून ते तंत्रज्ञानात प्रभावी बनतात हे वेगळे सांगायला नको. अश्या विविधांगी बाजूचा विचार करत समाजाची गरज ओळखून आणि समाजाला आजच्या तंत्रज्ञान क्रांतीसोबत प्रगतीशील करताना सदर “बुरुड बंधन” वेबसाईट आणि अप विनामूल्य स्वरुपात उपलब्ध करून देत आहोत. उपवर व उपवधू ह्यांची नोंदणी आणि माहिती घरबसल्या उपलब्ध करून देण हे या वेबसाईट आणि ॲप हा प्रमुख उद्देश असला तरीही त्यातून होणारी नोंदणी, विखुरलेला समाजाची गाव-तालुका-जिल्हा-क्षेत्रानुसार संख्या, समाजाची गरज, महत्वाचा संदेश समाजापर्यंत पोहचवणे, आपत्कालीन परीस्थितीमध्ये समाजाबंधावाना लागणारी मदत अश्या विविधांगी बाजूंनी उपयोगात आणता येईल. आपल्या समाजाला स्वयंपूर्ण होण्यासाठी निश्चितपणे ह्याचा फायदा होईल ह्याची मला आणि आमच्या संस्थेला खात्री आहे. हे वेबसाईट आणि ॲप ह्यात वेळोवेळी लागणाऱ्या गरजेनुसार बदल करणे देखील गरजेचे आहे. तेव्हा त्यासाठी आपल्या योग्य व अपेक्षित सूचना स्वागतार्ह आहे. धन्यवाद"
};

const EditAboutUs = () => {
  return (
    <div className='flex '>
        {/* edit button */}
        <div className='p-4 w-[10%] '>
            <div 
            className=' w-fit flex items-center gap-2
            text-white bg-sky-400 hover:bg-sky-500 p-2 rounded-md
            cursor-pointer
            '>
                <FaRegEdit />
                <p>Edit</p>
            </div>
        </div>

        <div className='w-[80%] p-4 flex flex-col gap-4'>
            <div>
                <HeadingAndparagraph content={aboutWebsite}  />
            </div>

            <div className='flex gap-4'>
                <div className='w-[50%]'>
                    <HeadingAndparagraph content={presidentSpeech} />
                </div>
                <div className='w-[50%]'>
                    <HeadingAndparagraph content={sachivSpeech} />
                </div>
            </div>
        </div>
</div>
  )
}

export default EditAboutUs